Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.DimensionTextManipulator.InputDirections
The Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.DimensionTextManipulator.InputDirections flags represent the different input directions used to manipulate dimension values.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.DimensionTextManipulator.InputDirections.None
No input direction.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.DimensionTextManipulator.InputDirections.Origin
The dimension segment will be resized from the origin point.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.DimensionTextManipulator.InputDirections.Start
The dimension segment will be resized from the start point.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.DimensionTextManipulator.InputDirections.End
The dimension segment will be resized from the end point.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.TextManipulation.DimensionTextManipulator.InputDirections.All
All supported directions.